_posts/2022-05-30-I-like-python-1.html
---
layout: post
title: Mocking in python
---


<div id="outline-container-org2d1537e" class="outline-2">
<h2 id="org2d1537e">Intro</h2>
<div class="outline-text-2" id="text-org2d1537e">
<p>
This post summarizes most common usage of magic mock and specifically
pytest-mock which is thin wrapper around magic mock.
</p>
</div>
</div>

<div id="outline-container-orgc9a436d" class="outline-2">
<h2 id="orgc9a436d">Patching&#xa0;&#xa0;&#xa0;<span class="tag"><span class="test">test</span>&#xa0;<span class="pytest">pytest</span>&#xa0;<span class="mocking">mocking</span></span></h2>
<div class="outline-text-2" id="text-orgc9a436d">
<p>
First useful feature is patching functions in module. 
Lets imagine we have following code in module ui.py
</p>

<div class="org-src-container">
<pre class="src src-python">from some_package import my_print_function
def render_data(data):
    my_print_function(data)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">import pytest
from pytest_mocking import MockerFixture

def test_1(mocker:Mockerfixture):
    print_mock = mocker.patch('ui.my_print_function')
    print_mock.return_value = ''

</pre>
</div>
</div>
</div>
